import React from 'react';
import style from './Rules.less';

const Rules = () => (
  <div className={style.rule_wrap}>
    <div className={style.head}>
      用户在接受熊猫生源宝相关金融服务之前，请务必仔细阅读本《用户隐私/使用协议》（以下或简称为“本协议”）条款并充分理解且同意本协议，特别是免责条款，用户相关权利限制条款，约定争议解决方式、法律适用的条款。
      除非用户已阅读并接受本协议的所有条款，否则用户无权使用生源宝相关金融服务。用户直接或通过各类方式间接下载、安装、使用生源宝服务和数据的行为，都将被视作已无条件接受本协议所涉全部内容；若用户对本协议的任何条款有异议，请停止以任何方式使用生源宝所提供的金融服务。
    </div>
    <div className={style.text}>
      <div>第一条</div>
      <p>
        用户以各种方式使用生源宝服务和数据（包括但不限于发表、宣传介绍、转载、浏览及利用生源宝或生源宝用户发布内容）的过程中，不得以任何方式利用生源宝直接或间接从事违反中国法律、以及社会公德的行为，且用户应当恪守下述承诺：
        <br />1.
        用户不得发布、传送、传播、存储、转载或提供违反中国法律、法规、其他规范性文件及社会公德的内容，不得违反宪法确定的基本原则，不得发布、传送、传播、存储、转载或提供危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一和社会稳定的、损害国家荣誉和利益的、煽动民族仇恨、民族歧视、破坏民族团结的内容，或破坏国家宗教政策、宣扬邪教和封建迷信的内容，或散布谣言，扰乱社会秩序的内容，或侮辱诽谤、色情、赌博、暴力、恐怖或教唆犯罪的、引起他人不安的内容，或煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的内容，或以非法民间组织名义活动的内容，以及其他任何违反国家法律法规政策的内容。
        <br />2. 用户不得发布、传送、传播侵害他人名誉权、知识产权、商业秘密等合法权利的内容。
        <br />3.
        用户不得进行任何诸如发布广告、推广信息、销售商品的行为，或者进行任何非法的侵害生源宝利益的行为；不得干扰、损害和侵犯生源宝的各种合法权利与利益。
        <br />4.
        用户不得发布涉及他人隐私、个人信息或资料的，干扰生源宝正常运营和侵犯其他用户或者第三方合法权益的信息。
        <br />5.
        用户不得进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/帐户;未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息;自行或利用其他软件对生源宝提供产品进行反向破解等违法行为。
        <br />6. 遵守生源宝以及与之相关的网络服务的协议、指导原则、管理细则等。
      </p>
    </div>
    <div className={style.text}>
      <div>第二条</div>
      <p>
        保护用户个人信息是生源宝的一项基本原则，生源宝将采取合理的措施保护用户的个人信息。除法律法规规定及本协议另有明确约定的情形外，未经用户许可，生源宝不会向第三方公开、透露用户个人信息。生源宝对相关信息采用专业加密存储与传输方式，保障用户个人信息安全。
        当用户使用提取奖金功能时，生源宝会收集用户的支付宝账号信息及身份证信息；支付宝会收集用户的姓名、银行卡类型及卡号、有效期及银行预留手机号。上述信息属于敏感信息，拒绝提供该信息会使用户无法使用支付宝提现生源宝奖金，但不影响正常使用生源宝的其他功能。
        生源宝可能将通过某些收集的信息用于其他服务，用户同意生源宝将用户的个人信息包括不限于姓名(昵称、账户名等)、头像（包括不限于肖像）、所获奖金数额、获奖排名等在生源宝上予以公开。用户同意并知晓生源宝的上述行为，并自行承担生源宝公开用户信息行为造成或可能造成的影响。
        生源宝不会对外公开披露其收集的个人信息，如必须公开披露时，生源宝会向用户告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得用户的明示同意。如生源宝使用用户的个人信息超出了生源宝收集时所声称的目的，生源宝将在使用前征得用户的明示同意。
        上述个人资料均由用户自行提供，用户依法应对其提供的任何信息承担全部责任。生源宝对此等信息的准确性、完整性、合法性或真实性均不承担任何责任。当政府部门、司法机关等依照法定程序要求生源宝披露个人资料时，生源宝将根据执法单位之要求或为公共安全之目的提供个人资料，在此情况下的披露，生源宝不承担任何责任。
      </p>
    </div>
    <div className={style.text}>
      <div>第三条</div>
      <p>
        任何单位或个人通过生源宝提供服务的内容可能涉嫌侵犯权利人的知识产权或信息网络传播权及其他合法权益的，权利人应该及时向生源宝提出书面权利通知投诉，并提供身份证明、权属证明及详细侵权情况证明。生源宝在收到上述法律文件后，将会依法尽快断开相关链接内容。生源宝提供投诉通道：sidney.shi@pdabc.com。如投诉中未向生源宝提供合法有效的证明材料，生源宝有权不采取任何措施。
      </p>
    </div>
    <div className={style.text}>
      <div>第四条</div>
      <p>
        本协议及其规则的成立、有效性、解释、履行和与本协议及其规则效力有关的争议解决等所有事宜，将受中华人民共和国法律管辖，任何争议仅适用中华人民共和国法律。如用户对本协议发生争议的，应当友好协商解决，协商不成的，应当将争议提交至北京市朝阳区人民法院管辖。
        生源宝有权对违反本协议约定的用户及其他侵权人追究相关法律责任的权利，包括不限于赔偿损失，承担追究责任所支出的律师费、诉讼费、保全费等。
      </p>
    </div>
    <div className={style.head}>
      对免责声明的解释、修改及更新权均属于熊猫生源宝所有。熊猫生源宝有权随时及时、修改、更新本协议并在熊猫生源宝上予以公告。经解释、修改、更新的条款一经在熊猫生源宝公布后，立即自动生效。如您不同意相关解释、修改、更新，必须停止使用熊猫生源宝数据和服务。
    </div>
  </div>
);

export default Rules;
